from dataclasses import dataclass

type_to_number_dict = {'': 0, 'No data': 0, 'улица': 1, 'переулок': 2, 'проезд': 3, 'микрорайон': 4, 'площадь': 5,
                       'проспект': 6, 'дорога': 7, 'линия': 8, 'тупик': 9, 'шоссе': 10,
                       'бульвар': 11, 'квартал': 12, 'аллея': 13, 'набережная': 14,
                       'посёлок': 15, 'мост': 16, 'спуск': 17, 'тракт': 18, 'массив': 19,
                       'путепровод': 20, 'тоннель': 21}

number_to_type_dict = {0: 'No data', 1: 'улица', 2: 'переулок', 3: 'проезд', 4: 'микрорайон', 5: 'площадь',
                       6: 'проспект', 7: 'дорога', 8: 'линия', 9: 'тупик', 10: 'шоссе',
                       11: 'бульвар', 12: 'квартал', 13: 'аллея', 14: 'набережная',
                       15: 'посёлок', 16: 'мост', 17: 'спуск', 18: 'тракт', 19: 'массив',
                       20: 'путепровод', 21: 'тоннель'}

english_georgian_dict = {
    'A': 'ა',
    'B': 'ბ',
    'C': 'ც',
    'D': 'დ',
    'E': 'ე',
    'F': 'ფ',
    'G': 'გ',
    'H': 'ჰ',
    'I': 'ი',
    'J': 'ჯ',
    'K': 'კ',
    'L': 'ლ',
    'M': 'მ',
    'N': 'ნ',
    'O': 'ო',
    'P': 'პ',
    'Q': 'ქ',
    'R': 'რ',
    'S': 'ს',
    'T': 'ტ',
    'U': 'უ',
    'V': 'ვ',
    'W': 'ვ',
    'X': 'კს',
    'Y': 'ი',
    'Z': 'ზ',
    'a': 'ა',
    'b': 'ბ',
    'c': 'ც',
    'd': 'დ',
    'e': 'ე',
    'f': 'ფ',
    'g': 'გ',
    'h': 'ჰ',
    'i': 'ი',
    'j': 'ჯ',
    'k': 'კ',
    'l': 'ლ',
    'm': 'მ',
    'n': 'ნ',
    'o': 'ო',
    'p': 'პ',
    'q': 'ქ',
    'r': 'რ',
    's': 'ს',
    't': 'ტ',
    'u': 'უ',
    'v': 'ვ',
    'w': 'ვ',
    'x': 'კს',
    'y': 'ი',
    'z': 'ზ'
}


@dataclass
class Street:
    name: str
    type: int
    coordinates: str
